driver-tests/bpelse/eventHandlers/onEventJBI/test/basic_onEvent_onScope/Input3.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inv="EventHandler1">
  <soapenv:Body><inv:EventHandler1Element>
<inv:string>1.11</inv:string>
       </inv:EventHandler1Element>
  </soapenv:Body>
</soapenv:Envelope>