driver-tests/bpelse/eventHandlers/onEventJBI/test/basic_onEvent_onScope_multiple/Input2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inv="EventHandler1">
  <soapenv:Body><inv:EventHandler1Element2>
<inv:string2>1.11</inv:string2>
       </inv:EventHandler1Element2>
  </soapenv:Body>
</soapenv:Envelope>